ab-logs/ab-log-phalconphp-1.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        Apache/2.2.22
Server Hostname:        localhost
Server Port:            80

Document Path:          /platform-tests/test-phalconphp/listall/?limit=1
Document Length:        1439 bytes

Concurrency Level:      1
Time taken for tests:   1.098 seconds
Complete requests:      10
Failed requests:        0
Write errors:           0
Total transferred:      17120 bytes
HTML transferred:       14390 bytes
Requests per second:    9.11 [#/sec] (mean)
Time per request:       109.783 [ms] (mean)
Time per request:       109.783 [ms] (mean, across all concurrent requests)
Transfer rate:          15.23 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       52   63  15.9     58     107
Processing:     0   47  19.2     50      77
Waiting:        0   47  19.2     50      76
Total:        105  110   8.5    106     132

Percentage of the requests served within a certain time (ms)
  50%    106
  66%    107
  75%    112
  80%    114
  90%    132
  95%    132
  98%    132
  99%    132
 100%    132 (longest request)