ab-logs/ab-log-wordpress-1.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking beta.sal.pr (be patient).....done


Server Software:        Apache/2.2.25
Server Hostname:        beta.sal.pr
Server Port:            80

Document Path:          /api/restaurants/listall/?limit=1
Document Length:        1765 bytes

Concurrency Level:      1
Time taken for tests:   14.913 seconds
Complete requests:      10
Failed requests:        0
Write errors:           0
Total transferred:      22840 bytes
HTML transferred:       17650 bytes
Requests per second:    0.67 [#/sec] (mean)
Time per request:       1491.268 [ms] (mean)
Time per request:       1491.268 [ms] (mean, across all concurrent requests)
Transfer rate:          1.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      929 1379 273.7   1445    1814
Processing:     3  112 177.0     64     585
Waiting:        2  111 177.0     63     584
Total:       1215 1491 177.0   1515    1821

Percentage of the requests served within a certain time (ms)
  50%   1515
  66%   1521
  75%   1627
  80%   1648
  90%   1821
  95%   1821
  98%   1821
  99%   1821
 100%   1821 (longest request)