ab-logs/ab-log-wordpress-500.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking beta.sal.pr (be patient).....done


Server Software:        Apache/2.2.25
Server Hostname:        beta.sal.pr
Server Port:            80

Document Path:          /api/restaurants/listall/?limit=500
Document Length:        1060294 bytes

Concurrency Level:      1
Time taken for tests:   278.879 seconds
Complete requests:      10
Failed requests:        0
Write errors:           0
Total transferred:      10608190 bytes
HTML transferred:       10602940 bytes
Requests per second:    0.04 [#/sec] (mean)
Time per request:       27887.903 [ms] (mean)
Time per request:       27887.903 [ms] (mean, across all concurrent requests)
Transfer rate:          37.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:    25209 27855 2054.5  28374   31208
Processing:     2   33  39.8     14     102
Waiting:        0    0   0.0      0       0
Total:      25215 27888 2041.5  28377   31222

Percentage of the requests served within a certain time (ms)
  50%  28377
  66%  28578
  75%  29255
  80%  30224
  90%  31222
  95%  31222
  98%  31222
  99%  31222
 100%  31222 (longest request)